cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "dteoh/sqa"

# The basics:
brew "git"
brew "vim"
brew "ack"
brew "ctags"
brew "watch"
brew "wget"
brew "rename"

brew "gnu-sed" # because BSD sed is still Bad™
brew "exa" # 'ls' but not awful

# A bunch of tools need these for compilation:
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "icu4c" # some library everything needs

brew "asdf"
brew "gpg" # needed for asdf-nodejs

brew "shellcheck" # sh/bash linter

brew "tig" # git history viewer
brew "git-delta" # pretty diff pager
brew "git-interactive-rebase-tool" # git rebase -i, with the ability to dig into logs, easily flip lines, etc.
tap "jesseduffield/lazygit"
brew "lazygit" # Console Git GUI

brew "bat" # cat with syntax highlighting
brew "mdcat" # cat markdown

brew "direnv" # pull environment variables from .envrc files
brew "starship" # prompt config

brew "hexyl" # hexdump but better
brew "httpie" # user-friendly curl alternative, eg. http PUT http://my/url foo=bar
brew "hyperfine" # benchmarking
brew "jq" # JSON parser + queries
brew "yq" # ... and the same for YAML
brew "gron" # Greppable JSON
brew "pv" # pipe-viewer, for progress of copies and the like
brew "moreutils" # misc, but includes "vipe".
brew "telnet" # just because

brew "fzf" # fuzzy-finder, good for CLI tools
brew "ripgrep" # ack/grep but fast and some bugs fixed

brew "pastel" # colour tool

brew "ncdu" # Hard-disk space spelunking
brew "pstree" # 'pstree -p $$' is my "am I in a bash session in a vim session in a bash session" checker
brew "entr" # file-watcher; use with pipes, eg. while true; do find . -name "*.js" | entr -dcs 'eslint'; done
brew "thefuck" # aliased as 'please'

brew "asciinema" # record terminal sessions to share + play back later

brew "sox" # audio tools
brew "ffmpeg" # video tools
brew "exiftool" # image tools
brew "imagemagick" # convert anything to anything, badly
brew "youtube-dl" # download (most) things

brew "terminal-notifier" # macOS notifications

brew "lazydocker" # docker + docker-compose management

brew "carthage" # MacOS dev package manager

brew "awscli" # *long sigh*

# Moonlander / QMK
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "avr-gcc"
brew "arm-gcc-bin"
brew "qmk/qmk/qmk"

tap "homebrew/cask-drivers"
brew "libusb"
cask "zsa-wally" # Flashing tool

# Neovim
tap "jason0x43/homebrew-neovim-nightly"
cask "neovim-nightly"

cask "iterm2"

cask "caffeine" # keep the machine awake
cask "karabiner-elements" # messing with key bindings
cask "muzzle" # turn off notifications during talks/streams
cask "flux" # because Night Shift has bugs when you have multiple monitors
cask "rectangle" # window management
cask "soundsource" # sound routing; paid.
cask "bitbar" # arbitrary menu-bar scripts and helpers, eg. timers

cask "slowquitapps"

cask "aws-vault"
cask "visual-studio-code"
cask "sim-daltonism" # colour-blindness/a11y tool

cask "keycastr" # key display, good for Quicktime screen recordings if you don't have ScreenFlow or OBS set up
cask "sonic-visualiser" # real-time spectral analysis tool
cask "typora" # ignore the void for a while
cask "vlc" # video player

cask "workflowy" # outliner / nested dotpoint organisation the things

# Possibly needed:
#cask "virtualbox"
#cask "tunnelblick"
#cask "blender"
#brew "postgres"


# To get IDs: mas list

mas "Boop", id: 1518425043 # Text scratchpad with transform scripts
mas "Boxy", id: 611658502 # Boxy SVG
mas "Calendarique", id: 1040634920
mas "Connect", id: 1352696344
mas "Fenêtre", id: 1288451627
mas "HazeOver", id: 430798174
mas "Sonance", id: 423666302
